package examples;

public class LibrariesConditionStatements {
    public static void main(String[] args) {

        //Оператор < (по-малко)
        //Оператор > (по-голямо)
        //Оператор <= (по-малко или равно)
        //Оператор >= (по-голямо или равно)
        //Оператор == (равно)
        //Оператор != (различно)

        //Проверка за равенство	==	             //числа, стрингове, дати
        //Проверка за различие	!=
        //По-голямо            	>	             //числа, дати, други сравними типове
        //По-голямо или равно	>=
        //По-малко	            <
        //По-малко или равно	<=

        //if (булев израз) {
        //    // тяло на условната конструкция,
        //    // което ще се изпълни единствено при верен булев израз;
        //}

        //if (булево условие) {
        //    // тяло на условната конструкция;
        //} else {
        //    // тяло на else-конструкция;
        //}

        //if (условие) {
        //    // тяло на условната конструкция;
        //} else if (условие2) {
        //    // тяло на условната конструкция;
        //} else if (условие3) {
        //    // тяло на условната конструкция;
        //} … else {
        //    // тяло на else-конструкция;
        //}

        // variable from type String.equals("text")  instead of ==
        // !"text".equals(variable from type String) instead of !=

        //String a = scanner.nextLine().toLowerCase();  -> make all words small
        //toIgnoreCase();  ->


    }
}
